Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthAll Property
 Division family cannot be used for all widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesForWidthAll { get; }
Public Shared ReadOnly Property DivideVolumesProfilesForWidthAll As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesForWidthAll {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesForWidthAll : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace